iterate/iterate/apps/kit/firmware/targets/stackchan/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# CoreS3 uses 16 MB QIO flash and quad 80 MHz PSRAM. DSP state belongs in
# PSRAM where the library permits it; DMA queues and ISR-visible chunks remain
# explicit internal allocations in the platform owner.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# ESP-IDF 5.4 renamed the old SPIRAM option.  This merely permits explicitly
# selected non-audio tasks to use external stacks; the audio owner keeps every
# DMA/ISR-visible byte in internal memory and never relies on this blanket.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ESP-SR missed its 32 ms deadline under the debug-oriented compiler profile
# in the prior hardware experiment. Performance is therefore a correctness
# setting for this target, while the linker size report remains a required
# artifact so the tradeoff cannot disappear from review.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# IDF's flag covers its own ISR path. The final target will additionally audit
# every Iterate callback/callee in the linked ELF before a physical build is
# accepted; otherwise a cache-disabled flash operation could stall audio.
CONFIG_I2S_ISR_IRAM_SAFE=y
# Atomic publication in PSRAM must never fetch the workaround from flash while
# the cache is disabled. The final ELF audit separately verifies our callback
# and raw-copy call graph; this option closes ESP-IDF's documented S3 atomic
# erratum path rather than relying on whichever default the SDK picks.
CONFIG_STDATOMIC_S32C1I_SPIRAM_WORKAROUND=y
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Single-socket voice lane additions (see the Waveshare port) ---------

# 1ms ticks: pdMS_TO_TICKS() of anything under 10ms rounds to ZERO at the
# 100Hz default, and vTaskDelay(0) busy-spins.
CONFIG_FREERTOS_HZ=1000
CONFIG_GDMA_ISR_IRAM_SAFE=y
# Pin lwIP to the network core; the audio tasks own core 1.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y

# Hardware watchdog on the app task: every software self-heal runs ON that
# task, so none of them can fire when it is the thing that is stuck.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_ESP_TASK_WDT_PANIC=y

# The microphone does not fit in a 5760-byte socket — and on this board it
# streams for the WHOLE call, so the send window matters even more than on
# the push-to-talk boards.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=24
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=12

#
# The camera's DMA buffer, held only while a photograph is being taken.
#
# 8192, the minimum this driver allows, rather than its 32768 default. With
# the default the internal heap fell to 1,275 bytes while the sensor was up —
# and every TLS write needs a few kilobytes of that same pool for an AES
# context, so a stats push landing inside the ~500 ms shutter window dropped
# the socket. Smaller buffers mean more frequent DMA interrupts; on a board
# that takes an occasional diagnostic photograph and holds a continuous voice
# call, that is the correct side to err on.
#
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=8192
